# Messages d'erreurs de validation Personne
personne.nom.size=Le nom doit comporter entre 3 et 90 caract\u00E8res.
personne.nom.notnull=Le nom est obligatoire.
personne.nom.notblank=Le nom ne doit pas \u00EAtre vide.

personne.prenom.size=Le pr\u00E9nom doit comporter entre 3 et 150 caract\u00E8res.
personne.prenom.notnull=Le pr\u00E9nom est obligatoire.
personne.prenom.notblank=Le pr\u00E9nom ne doit pas \u00EAtre vide.

personne.email.size=L'adresse email doit comporter entre 10 et 255 caract\u00E8res.
personne.email.notnull=L'adresse email est obligatoire.
personne.email.notblank=L'adresse email ne doit pas \u00EAtre vide.

# Messages d'erreurs de validation Adresse
adresse.rue.size=La rue doit comporter au maximum 250 caract\u00E8res.
adresse.codePostal.size=Le code postal doit comporter au maximum 5 caract\u00E8res.
adresse.ville.size=La ville doit comporter au maximum 200 caract\u00E8res.
adresse.departement.notnull=Le d\u00E9partement est obligatoire.
adresse.departement.notblank=Le d\u00E9parteement ne doit pas \u00EAtre vide.


# Messages d'erreurs de validation Apprenant
apprenant.numPortable.size=Le num\u00E9ro de t\u00E9l\u00E9phone doit comporter entre 10 caract\u00E8res.
apprenant.dateNaissance.notnull=La date de naissance est obligatoire.

apprenant.numPasseport.size=Le num\u00E9ro de passeport doit comporter au maximum 120 caract\u00E8res.
apprenant.statutNumPasseport.notnull=Le statut du passeport est obligatoire.
apprenant.commentaireApprenant.size=Le commentaire doit comporter au maximum 2000 caract\u00E8res.



# Messages d'erreurs de validation SessionApprenant
sessionApprenant.commentaireSessionApprenant.size=Le commentaire doit comporter au maximum 2000 caract\u00E8res.
sessionApprenant.modeReceptionInscription.size= Le mode de r\u00E9ception doit \u00EAtre compris entre 3 et 20 caract\u00E8res.
sessionApprenant.modeReceptionInscription.notnull=Le mode de r\u00E9ception doit \u00EAtre obligatoire.
sessionApprenant.modeReceptionInscription.notblank=Le mode de r\u00E9ception ne doit pas \u00EAtre vide.

sessionApprenant.apprenant.notnull=L'apprenant est obligatoire.
sessionApprenant.sessionFormation.notnull= La formation est obligatoire.


# Messages d'erreurs de validation Departement
departement.numDepartement.size=Le num\u00E9ro du d\u00E9partement doit \u00EAtre compris entre 2 et 3 caract\u00E8res.
departement.numDepartement.notnull=Le num\u00E9ro du d\u00E9partement est obligatoire.
departement.numDepartement.notblank=Le num\u00E9ro du d\u00E9partement ne doit pas \u00EAtre vide.

departement.nomDepartement.size=Le nom du d\u00E9partement doit \u00EAtre compris entre 3 et 100 caract\u00E8res.
departement.nomDepartement.notnull=Le nom du d\u00E9partement est obligatoire.
departement.nomDepartement.notblank=Le nom du d\u00E9partement ne doit pas \u00EAtre vide.

departement.region.size= Le nom de la r\u00E9gion doit \u00EAtre compris entre 3 et 100 caract\u00E8res.
departement.region.notnull= La r\u00E9gion doit \u00EAtre obligatoire.
departement.region.notblank= La r\u00E9gion ne doit pas \u00EAtre nulle.

departement.couleurDepartement.size=La taille de la couleur du d\u00E9partement doit \u00EAtre comprise entre 3 et 7 caract\u00E8res.
departement.couleurDepartement.notnull=La couleur du d\u00E9partement est obligatoire.
departement.couleurDepartement.notblank=La couleur du d\u00E9partement ne doit pas \u00EAtre vide.

# Messages d'erreurs de validation CategorieDocument
categorieDocument.libelle.size=Le nom de la cat\u00E9gorie du document doit \u00EAtre compris etre 2 et 120 caract\u00E8res.
categorieDocument.libelle.notnull=Le nom de la cat\u00E9gorie du document est obligatoire.
categorieDocument.libelle.notblank=Le nom de la cat\u00E9gorie du document ne doit pas \u00EAtre vide.

# Messages d'erreurs de validation SessionApprenantDocument
sessionApprenantDocument.nom.size=Le nom du document doit \u00EAtre compris \u00EAtre 2 et 200 caract\u00E8res.
sessionApprenantDocument.nom.notnull=Le nom du document est obligatoire.
sessionApprenantDocument.nom.notblank=Le nom du document ne doit pas \u00EAtre vide.

sessionApprenantDocument.fichier.size=Le nom du chemin du document doit avoir au maximum 2000 caract\u00E8res.
sessionApprenantDocument.sessionApprenant.notnull=La session de l'apprenant est obligatoire.
sessionApprenantDocument.categorieDocument.notnull=La cat\u00E9gorie du document est obligatoire.


# Messages d'erreurs de validation de Facture
facture.numFacture.size=Le num\u00E9ro de la facture doit \u00EAtre compris \u00EAtre 3 et 50 caract\u00E8res.
facture.numFacture.notnull=Le num\u00E9ro de la facture doit \u00EAtre obligatoire.
facture.numFacture.notblank=Le num\u00E9ro de la facture ne doit pas \u00EAtre vide.

facture.typeFacture.size=Le type de la facture doit \u00EAtre compris \u00EAtre 3 et 50 caract\u00E8res.
facture.typeFacture.notnull=Le type de la facture doit \u00EAtre obligatoire.
facture.typeFacture.notblank=Le type de la facture ne doit pas \u00EAtre vide.

facture.libelleFacture.size=Le type de la facture doit \u00EAtre compris \u00EAtre 3 et 120 caract\u00E8res.
facture.libelleFacture.notnull=Le type de la facture doit \u00EAtre obligatoire.
facture.libelleFacture.notblank=Le type de la facture ne doit pas \u00EAtre vide.

facture.montantFacture.notblank=Le montant de la facture ne doit pas \u00EAtre vide.

# Messages d'erreurs de validation de Formateur
formateur.numPortable.size=Le num\u00E9ro de t\u00E9l\u00E9phone doit comporter au maximum 10 caract\u00E8res.

formateur.statutFormateur.size=Le statut du formateur doit \u00EAtre compris entre 1 et 10 caract\u00E8res.
formateur.statutFormateur.notnull=Le statut du formateur doit \u00EAtre obligatoire.
formateur.statutFormateur.notblank=Le statut du formateur ne doit pas \u00EAtre vide.

formateur.zoneIntervention.size= La zone d'intervention doit comporter au maximum 1000 caract\u00E8res.
formateur.commentaireFormateur.size= Le commentaire doit comporter au maximum 2000 caract\u00E8res.



# Messages d'erreurs de validation de la Session Formateur
sessionFormateur.commentaireFormateur.size= Le commentaire doit comporter au maximum 2000 caract\u00E8res.
sessionFormateur.formateur.notnull=Le formateur est obligatoire.
sessionFormateur.sessionFormation.notnull=La session de formation est obligatoire.

# Messages d'erreurs de validation de la Session Formation
formation.themeFormation.size= Le th\u00E8me de la formation doit comporter entre 3 et 20 caract\u00E8res.
formation.themeFormation.notnull=Le th\u00E8me de la formation est obligatoire.
formation.themeFormation.notblank=Le th\u00E8me de la formation ne doit pas \u00EAtre vide.

formation.libelleFormation.size= Le libell\u00E9 de la formation doit comporter entre 3 et 30 caract\u00E8res.
formation.libelleFormation.notnull=Le libell\u00E9 de la formation est obligatoire.
formation.libelleFormation.notblank=Le libell\u00E9 de la formation ne doit pas \u00EAtre vide.

formation.typeFormation.notnull=Le type de la formation est obligatoire.


# Messages d'erreurs de validation du Type de formation
typeFormation.libelle.size= Le libell\u00E9 du type de formation doit comporter entre 5 et 10 caract\u00E8res.
typeFormation.libelle.notnull=Le libell\u00E9 du type formation est obligatoire.
typeFormation.libelle.notblank=Le libell\u00E9 du type formation ne doit pas \u00EAtre vide.


# Messages d'erreurs de validation de la note de frais
noteDeFrais.libelle.size= Le libell\u00E9 de la note de frais doit comporter entre 3 et 120 caract\u00E8res.
noteDeFrais.libelle.notnull=Le libell\u00E9 de la note de frais est obligatoire.
noteDeFrais.libelle.notblank=Le libell\u00E9 de la note de frais ne doit pas \u00EAtre vide.

noteDeFrais.dateSessionFormation.notnull=La date de session de formation est obligatoire.
noteDeFrais.dateNoteDeFrais.notnull=La date de note de frais est obligatoire.
noteDeFrais.dateReglementNoteDeFrais.notnull=La date du r\u00E8glement de la note de frais est obligatoire.

noteDeFrais.montantRepas.max=Le montant du repas ne doit pas d\u00E9passer 15 euros.
noteDeFrais.montantPauseCafe.max=Le montant pour la pause caf\u00E9 ne doit pas d\u00E9passer 7 euros.
noteDeFrais.montantTotal.notnull=Le montant total de la note de frais est obligatoire.


# Messages d'erreurs de validation du salari\u00E9
salarie.mdp.size= Le mot de passe ne doit pas d\u00E9passer 68 caract\u00E8res.
salarie.couleurSalarie.size= La couleur salari\u00E9 doit \u00EAtre comprise entre 3 et 7 caract\u00E8res.
salarie.couleurSalarie.notnull= La couleur salari\u00E9 est obligatoire.
salarie.couleurSalarie.notblank= La couleur salari\u00E9 ne doit pas \u00EAtre vide.

salarie.roleSalarie.size= Le r\u00F4le salari\u00E9 doit \u00EAtre comprise entre 3 et 50 caract\u00E8res.
salarie.roleSalarie.notnull= Le r\u00F4le salari\u00E9 est obligatoire.
salarie.roleSalarie.notblank= Le r\u00F4le salari\u00E9 ne doit pas \u00EAtre vide.

salarie.statutInscription.notnull= Le r\u00F4le salari\u00E9 est obligatoire.


# Messages d'erreurs de validation de la salle
salle.nom.size= Le nom de la salle doit \u00EAtre compris entre 5 et 255 caract\u00E8res.
salle.nom.notnull= Le nom de la salle est obligatoire.
salle.nom.notblank= Le nom de la salle ne doit pas \u00EAtre vide.

salle.nomContact.size= Le nom de la salle doit \u00EAtre compris entre 5 et 200 caract\u00E8res.
salle.portableContact.size=Le num\u00E9ro du portable du contact doit comporter au maximum 10 caract\u00E8res.
salle.mailContact.size=Le mail du contact doit comporter au maximum 255 caract\u00E8res.

salle.digiCodeSalle.size=Le digicode de la salle doit comporter au maximum 10 caract\u00E8res.
salle.commentaireSalle.size=Le commentaire de la salle doit comporter au maximum 2000 caract\u00E8res.

# Messages d'erreurs de validation de la SessionSalle
sessionSalle.commentaire.size= Le commentaire de la sessionSalle doit avoir au maximum 2000 caract\u00E8res.
sessionSalle.salleId.notnull= Le salle est obligatoire.
sessionSalle.sessionFormation.notnull= La formation est obligatoire.


# Messages d'erreurs de validation de la SessionFinFormation
sessionFinFormation.statutYoda.size=Le statut Yoda de la fin de session doit comporter au maximum 5 caract\u00E8res.
sessionFinFormation.commentaire.size=Le commentaire de la fin de session doit comporter au maximum 2000 caract\u00E8res.

# Messages d'erreurs de validation de la SessionFormation
sessionFormation.numAfYoda.size= Le num\u00E9ro AF Yoda doit avoir au maximum 30 caract\u00E8res.
sessionFormation.libelle.size= Le libell\u00E9 de la session de formation doit avoir au maximum 50 caract\u00E8res.
sessionFormation.statutYoda.size= Le statut Yoda doit \u00EAtre compris entre 1 et 5 caract\u00E8res.
sessionFormation.statutYoda.notnull= Le statut Yoda obligatoire.
sessionFormation.statutYoda.notblank= Le statut Yoda ne doit pas \u00EAtre vide.
sessionFormation.statutSessionFormation.notnull = Le statut de la session de formation est obligatoire.

sessionFormation.dateDebutSession.notnull= La date du d\u00E9but de la session est obligatoire.
sessionFormation.nbHeureSession.notnull= Le nombre d'heures de la session est obligatoire.

sessionFormation.formation.notnull = La formation rattach\u00E9e \u00E0 la session de formation est obligatoire.

# Messages d'erreurs de validation de la SessionFormationDistanciel - FOAD
sessionFormationDistanciel.contratSessionFoad.size= Le contrat doit avoir au maximum 300 caract\u00E8res.
sessionFormationDistanciel.dateDebutSessionFoad.notnull = La formation en distanciel doit avoir une date de d\u00E9but.
sessionFormationDistanciel.dateFinSessionFoad.notnull = La formation en distanciel doit avoir une date de fin.
sessionFormationDistanciel.commentaireSessionFoad.size = Le commentaire doit avoir au maximum 2000 caract\u00E8res.

# Messages d'erreurs de validation de la SessionLieuDate
sessionLieuDate.dateSession.notnull= La date de session est obligatoire.
sessionLieuDate.lieuSession.size = Le lieu doit avoir au maximum 100 caract\u00E8res.

sessionLieuDate.sessionFormation.notnull= La session de formation est obligatoire.